tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Src/py32f032_hal_flash_ex.c
  return status;
}

/**
  * @brief  Get the Option bytes configuration.
  * @param  pOBInit pointer to an FLASH_OBInitStruct structure that contains the
  *         configuration information.
  * @note   pOBInit->PCROPConfig should indicate which area is requested for PCROP, 
  *         else no information will be returned.
  * @retval None
  */
void HAL_FLASHEx_OBGetConfig(FLASH_OBProgramInitTypeDef *pOBInit)
{
  pOBInit->OptionType = (OPTIONBYTE_WRP | OPTIONBYTE_RDP | OPTIONBYTE_USER | OPTIONBYTE_PCROP | OPTIONBYTE_SEC);

  /* Get Write protection level */
  pOBInit->WRPSector = FLASH_OB_GetWRP();

  /* Get Read protection level */
  pOBInit->RDPLevel = FLASH_OB_GetRDP();

  /* Get the user option bytes */
  pOBInit->USERConfig = FLASH_OB_GetUser();

  FLASH_OB_GetPCROP(&(pOBInit->PCROPStartAddr), &(pOBInit->PCROPEndAddr));

  FLASH_OB_GetSecMem(&(pOBInit->SecSize));
}

/**
  * @brief  Enable the FLASH Securable Memory protection.
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASHEx_EnableSecMemProtection()
{
  SET_BIT(FLASH->CR, FLASH_CR_SECPROT);

  return HAL_OK;
}


/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/** @addtogroup FLASHEx_Private_Functions
  * @{
  */
/**
  * @brief  Mass erase of FLASH memory.
  * @retval None
  */
void FLASH_MassErase(void)
{
  SET_BIT(FLASH->CR, FLASH_CR_MER);
  *(__IO uint32_t *)(FLASH_BASE) = 0x12344321;
}

/**
  * @brief  Erase the specified FLASH memory page.
  * @param  PageAddress FLASH page to erase.
  *         This parameter must be a value between 0 and (max number of pages in the bank - 1).
  * @retval None
  */
void FLASH_PageErase(uint32_t PageAddress)
{
  /* Check the parameters */
  assert_param(IS_FLASH_PAGE(PageAddress));

  /* Proceed to erase the page */
  SET_BIT(FLASH->CR, FLASH_CR_PER);
  *(__IO uint32_t *)(PageAddress) = 0x12344321;
}

/**
  * @brief  Sector erase of FLASH memory
  * @param  SectorAddress sector erase address
  * @retval None
  */
void FLASH_SectorErase(uint32_t SectorAddress)
{
  SET_BIT(FLASH->CR, FLASH_CR_SER);
  *(__IO uint32_t *)(SectorAddress) = 0x12344321;
}

/**
  * @brief  Page program of FLASH memory
  * @param  Address  Specifies the address to be programmed.
  * @param  DataAddress  Specifies the data to be programmed
  * @retval None
  */
void FLASH_Program_Page(uint32_t Address, uint32_t * DataAddress)
{
  uint8_t index=0;
  uint32_t dest = Address;
  uint32_t * src = DataAddress;
  uint32_t primask_bit;

  SET_BIT(FLASH->CR, FLASH_CR_PG);
  /* Enter critical section */
  primask_bit = __get_PRIMASK();
  __disable_irq();
  /* 64 words*/
  while(index < 32U) 
  {
    *(uint32_t *)dest = *src;
    src += 1U;
    dest += 4U;
    index++;
    if(index == 31)
    {
      SET_BIT(FLASH->CR, FLASH_CR_PGSTRT);
    }
  }
  /* Exit critical section: restore previous priority mask */
  __set_PRIMASK(primask_bit);
}

/**
  * @brief  UserData erase 
  * @retval None
  */
void FLASH_UserDataErase(uint32_t UserDataAddress)
{
  SET_BIT(FLASH->CR, FLASH_CR_UPER);
  *(__IO uint32_t *)(UserDataAddress) = 0x12344321;
}

/**
  * @brief  Program the UserData
  * @retval None
  */
void FLASH_Program_UserData(uint32_t Address, uint32_t * DataAddress)
{
  uint8_t index=0;
  uint32_t dest = Address;
  uint32_t * src = DataAddress;
  uint32_t primask_bit;

  SET_BIT(FLASH->CR, FLASH_CR_UPG);
  /* Enter critical section */
  primask_bit = __get_PRIMASK();
  __disable_irq();
  /* 32 words*/
  while(index<32U)
  {
    *(uint32_t *)dest = *src;
    src += 1U;
    dest += 4U;
    index++;
    if(index==31)
    {
      SET_BIT(FLASH->CR, FLASH_CR_UPGSTRT);
    }
  }

  /* Exit critical section: restore previous priority mask */
  __set_PRIMASK(primask_bit);
}

/**
  * @brief  Configure the write protection area into Option Bytes.
  * @param  WRPArea specifies the area to be configured.
  *         This parameter can be a combination of the following values:
  *            @arg OB_WRP_SECTOR_0         : Flash Sector 0
  *            @arg OB_WRP_SECTOR_1         : Flash Sector 1
  *            @arg OB_WRP_SECTOR_2         : Flash Sector 2
  *            @arg OB_WRP_SECTOR_3         : Flash Sector 3
  *            @arg OB_WRP_SECTOR_4         : Flash Sector 4
  *            @arg OB_WRP_SECTOR_5         : Flash Sector 5
  *            @arg OB_WRP_SECTOR_6         : Flash Sector 6
  *            @arg OB_WRP_SECTOR_7         : Flash Sector 7
  *            @arg OB_WRP_SECTOR_8         : Flash Sector 8
  *            @arg OB_WRP_SECTOR_9         : Flash Sector 9
  *            @arg OB_WRP_SECTOR_10        : Flash Sector 10
  *            @arg OB_WRP_SECTOR_11        : Flash Sector 11
  *            @arg OB_WRP_SECTOR_12        : Flash Sector 12
  *            @arg OB_WRP_SECTOR_13        : Flash Sector 13
  *            @arg OB_WRP_SECTOR_14        : Flash Sector 14
  *            @arg OB_WRP_SECTOR_15        : Flash Sector 15
  *            @arg OB_WRP_Pages0to31       : Flash Sector 0
  *            @arg OB_WRP_Pages32to63      : Flash Sector 1 
  *            @arg OB_WRP_Pages64to95      : Flash Sector 2
  *            @arg OB_WRP_Pages96to127     : Flash Sector 3            
  *            @arg OB_WRP_Pages128to159    : Flash Sector 4          
  *            @arg OB_WRP_Pages160to191    : Flash Sector 5         
  *            @arg OB_WRP_Pages192to223    : Flash Sector 6          
  *            @arg OB_WRP_Pages224to255    : Flash Sector 7          
  *            @arg OB_WRP_Pages256to287    : Flash Sector 8           
  *            @arg OB_WRP_Pages288to319    : Flash Sector 9          
  *            @arg OB_WRP_Pages320to351    : Flash Sector 10           
  *            @arg OB_WRP_Pages352to383    : Flash Sector 11        
  *            @arg OB_WRP_Pages384to415    : Flash Sector 12          
  *            @arg OB_WRP_Pages416to447    : Flash Sector 13         
  *            @arg OB_WRP_Pages448to479    : Flash Sector 14           
  *            @arg OB_WRP_Pages480to511    : Flash Sector 15       
  *            @arg OB_WRP_AllPages               : ALL Pages 
  * @retval HAL_Status
  */
static HAL_StatusTypeDef FLASH_OB_WRPConfig(uint32_t WRPArea)
{
  HAL_StatusTypeDef status;

  /* Check the parameters */
  assert_param(IS_OB_WRPAREA(WRPArea));

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

  if (status == HAL_OK)
  {
    FLASH->WRPR = (uint32_t)(~WRPArea);
  }

